# Используем легковесный официальный образ Python
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл зависимостей
COPY requirements.txt .

# Устанавливаем библиотеки без сохранения кэша (для уменьшения размера образа)
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь исходный код проекта в контейнер
COPY . .

# Открываем порт 8000, на котором работает наш FastAPI сервер
EXPOSE 8000

# Команда для запуска сервера при старте контейнера
CMD ["uvicorn", "src.server:app", "--host", "0.0.0.0", "--port", "8000"]
